// 小张很多年过年都没有回家了。 
// 这次回家父母给他安排了很多个相亲的姑娘， 有一个很长的名单，长度为N。
// 父亲负责安排约会，每次随机的选择一个要相亲的对象， 母亲负责记录哪些姑娘已经约会过了。
// 直到和所有的姑娘都约会完一遍以后，这个浩大的相亲工程才会结束。
// 这些天父母在吵架， 他们之间不会有任何言语沟通。所以父亲不知道那些姑娘已经约会过了。
// 因此下次约会的对象很可能是以前已经约会过的。
// 如果小张要把所有的姑娘都约会一遍， 那么平均需要约会多少个姑娘。

// 编译器版本: gcc 4.8.4
// 请使用标准输入输出(stdin，stdout) ；请把所有程序写在一个文件里，勿使用已禁用图形、文件、网络、系统相关的头文件和操作，如sys/stat.h , unistd.h , curl/curl.h , process.h
// 时间限制: 1S (C/C++以外的语言为: 3 S)   内存限制: 64M (C/C++以外的语言为: 576 M)
// 输入:
// 整数N， 1=<N <=100000;
// 输出:
// 返回如题描述的值，精确到小数点后4位。比如(1.0000, 0.0000, 0.1004)
// 输入范例:
// 1
// 输出范例:
// 1.0000
